---
kind: property
id: P:Autodesk.Revit.DB.GeomCombinationSet.IsEmpty
source: html/6a8334c7-4372-c8e6-acc5-66fd4d4c5187.htm
---
# Autodesk.Revit.DB.GeomCombinationSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.